{
  "backend/main.mo": "Motoko actor that manages a photo gallery app with CRUD operations for Gallery and Image entities, using blob storage for images and in-memory Maps for persistence.",
  "feature_evidence.json": "Feature evidence report linking the production deployment feature to its associated files, components, and test IDs for the Internet Computer environment.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing component responsibilities and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark themes including colors, borders, charts, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the Brilliant Coaching Centre app, setting metadata, theme color, and mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in QueryClientProvider and LanguageProvider, composing all page sections and utility components in order.",
  "frontend/src/components/About.tsx": "About Us section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons and bilingual text support.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form that collects student name, class, subject, and mobile number, then redirects to a pre-filled WhatsApp message on submission with validation and toast feedback.",
  "frontend/src/components/Contact.tsx": "Contact section showing address, phone, and WhatsApp info cards with clickable actions, plus an embedded Google Maps iframe for the Puabagan, Bankura location.",
  "frontend/src/components/Courses.tsx": "Displays a 'Courses Offered' section with three course cards (LKG–IV, V–X, XI–XII) showing icons, subjects, and descriptions, with bilingual English/Bengali support.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button that opens a pre-filled WhatsApp chat with the coaching centre's number when clicked.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with the centre's logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), and a watermark background logo.",
  "frontend/src/components/Gallery.tsx": "Photo gallery component combining static images with backend-stored images, supporting lightbox viewing, image upload with progress tracking, and image deletion via React Query hooks.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section displaying the centre's logo, name, tagline (Education/Discipline/Success), and a WhatsApp admission enquiry CTA button with animated background elements.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed toggle button in the top-right corner that switches the site language between English and Bengali using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Displays a 'Coming Soon' student dashboard section previewing three upcoming features: notes/test results, login system, and attendance records.",
  "frontend/src/components/SubmitReview.tsx": "Form component allowing students to submit a review with name, class/year, subjects, star rating, and written feedback, with validation and toast notifications.",
  "frontend/src/components/Teachers.tsx": "Renders a 'Our Teachers' section displaying a grid of three teacher cards with avatar, name, classes, subjects, experience, and focus points, supporting English/Bengali language switching.",
  "frontend/src/components/TeachersNotes.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Testimonials.tsx": "Renders a 'Testimonials' section with a title, intro text, and a blank-state message indicating no reviews yet, with English/Bengali language support.",
  "frontend/src/components/WhyChooseUs.tsx": "Renders a 'Why Choose Us' section displaying five benefit cards (experienced teachers, small batches, regular tests, friendly environment, affordable fees) with icons and bilingual text.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for English/Bengali language toggling, persisting the selected language in sessionStorage and exposing a translation helper function `t`.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for gallery CRUD operations (fetch all galleries, fetch images by gallery, create gallery, add image, delete image) against the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a dark-themed design system using OKLCH color variables (gold/maroon palette) with custom utility classes and keyframe animations.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with OKLCH-based custom colors (gold, maroon, chart, sidebar), custom fonts (Inter/Poppins), border radii, and accordion animations.",
  "project_state.json": "Project state metadata for 'Brilliant Coaching Centre' tracking schema version, existing features, and deployment status on the Internet Computer."
}