{
  "backend/main.mo": "Main Motoko actor implementing blob storage mixin with data structures and CRUD operations for students, test results, attendance, galleries, images, and reviews (including approval workflow).",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to the StudentDashboard component: creation with bilingual support, three feature cards display, coming soon badge, and integration into App.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero, About, Courses, Gallery, Contact, Teachers, StudentDashboard, and supporting contexts/hooks with bilingual support and responsive design details.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the Brilliant Coaching Centre branding (gold, maroon, dark backgrounds).",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Brilliant Coaching Centre Website', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and LanguageProvider, rendering all page sections in order including the new StudentDashboard component between Contact and Footer.",
  "frontend/src/components/About.tsx": "About Us section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with validation that collects student name, class, subject, and mobile number, then sends a formatted WhatsApp message to +91 98834 48350 with toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying address, phone, and WhatsApp contact info with interactive cards and an embedded Google Maps iframe for location.",
  "frontend/src/components/Courses.tsx": "Courses section component showcasing three course levels (LKG-IV, V-X, XI-XII) with subjects, descriptions, and icons in a responsive card grid.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button in bottom-right corner that opens WhatsApp chat with a pre-filled message when clicked.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), copyright notice, and watermark background.",
  "frontend/src/components/Gallery.tsx": "Photo gallery section with a grid of images that open in a lightbox dialog with navigation controls for previous/next image browsing.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline (Education/Discipline/Success), and WhatsApp admission enquiry CTA button.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed language toggle button in top-right corner that switches between English and Bengali using the language context.",
  "frontend/src/components/StudentDashboard.tsx": "Displays a 'Coming Soon' section for the student dashboard feature, showcasing three planned features (login system, notes/test results, attendance tracking) with icons and bilingual descriptions.",
  "frontend/src/components/SubmitReview.tsx": "Provides a form for students to submit reviews with fields for name, class/year, subjects, review text, and a 5-star rating system; uses mutation hook to submit data and displays toast notifications.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatar placeholders, their teaching subjects, experience, and focus areas in a card layout.",
  "frontend/src/components/TeachersNotes.tsx": "Shows a tabbed interface for class-wise teacher notes organized by grade ranges (LKG-3, 4-10, 4-12), displaying teacher info, subjects, and downloadable note features for each category.",
  "frontend/src/components/Testimonials.tsx": "Renders a testimonials section with a blank state message indicating no reviews yet, encouraging users to be the first to share their experience with decorative background elements.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid layout with icons and bilingual descriptions.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for bilingual support (English/Bengali) with language toggle functionality, translation helper function, and session storage persistence for the selected language.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for review operations including submitting reviews (mutation) and fetching all/approved reviews (queries) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography settings for the coaching centre brand.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), container settings, custom animations (accordion), and typography/container query plugins.",
  "project_state.json": "Project metadata describing a bilingual coaching centre website with features including hero section, course listings, teacher profiles, photo gallery, testimonials, review submission, and WhatsApp integration using gold/maroon branding."
}