{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented TeachersNotes component features including tabbed navigation, teacher profiles for three class ranges (LKG-3, 4-10, 4-12), and download functionality with bilingual support.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing a bilingual coaching centre website with hero, about, courses, teachers, gallery, admission form, contact sections, and floating UI elements.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point that loads the React application into a root div and references the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that wraps the entire application in LanguageProvider and renders all page sections including Hero, About, Courses, Teachers, TeachersNotes, Gallery, AdmissionForm, Contact, Footer, and floating UI elements.",
  "frontend/src/components/About.tsx": "About section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with validation that collects student details (name, class, subject, mobile) and sends formatted WhatsApp message to +91 98834 48350 with toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact methods (Address, Phone, WhatsApp) with clickable actions and a map placeholder, all with bilingual support and hover effects.",
  "frontend/src/components/Courses.tsx": "Displays a grid of three course offerings (LKG-IV, V-X, XI-XII) with icons, subjects, and descriptions in both English and Bengali. Uses Card components with hover effects and gradient styling.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that opens a WhatsApp chat with a pre-filled message for inquiries.",
  "frontend/src/components/Footer.tsx": "Displays footer with watermark logo, contact information, copyright notice, and attribution link to caffeine.ai. Includes bilingual content support.",
  "frontend/src/components/Gallery.tsx": "Shows a photo gallery grid with lightbox dialog for full-size viewing. Includes navigation controls (previous/next) and displays classroom and event images with hover effects.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline (Education • Discipline • Success), and WhatsApp CTA button for admission enquiries.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right button that toggles between English and Bengali languages using the LanguageContext.",
  "frontend/src/components/Teachers.tsx": "Displays three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and teaching focus areas in card layout.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed interface showing teacher profiles with downloadable class notes for three class ranges (LKG-3, 4-10, 4-12). Includes teacher avatars, experience, and note features with download functionality.",
  "frontend/src/components/WhyChooseUs.tsx": "React component displaying five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid with icons, bilingual support, and hover animations.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual language switching (English/Bengali) with sessionStorage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor with authentication support, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, OKLCH color space, custom animations (fade-in, scroll, gradient), and utility classes for brand colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), custom animations, typography plugin, and container queries support.",
  "project_state.json": "Project metadata defining a bilingual coaching center website with architectural notes, feature list, generated teacher images, and design specifications (gold/yellow text, dark background, maroon accents, WhatsApp integration)."
}