{
  "backend/main.mo": "Main backend actor implementing gallery management (create, get, delete), image management with blob storage, and review management with moderation (submit, approve, fetch) using Map data structures.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the SubmitReview component with form fields, validation, toast notifications, styling, and integration into App.tsx.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero, About, Courses, Gallery, SubmitReview, AdmissionForm, Contact, Footer, language context, and styling configurations.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the Brilliant Coaching Centre branding (gold, maroon, dark backgrounds).",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Brilliant Coaching Centre Website', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and LanguageProvider, rendering all sections in order including Hero, About, Courses, Teachers, Gallery, SubmitReview, AdmissionForm, Contact, Footer, and floating UI elements.",
  "frontend/src/components/About.tsx": "About Us section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations in a responsive grid.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with fields for student name, class, subject, and mobile number that validates input and opens WhatsApp with pre-filled message, showing toast notifications for feedback.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying address, phone, and WhatsApp info with clickable actions and a map placeholder. Uses bilingual translations and hover animations.",
  "frontend/src/components/Courses.tsx": "Courses section component showing three course tiers (LKG-IV, V-X, XI-XII) with subjects, descriptions, and icons. Uses cards with hover effects and bilingual content.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button in bottom-right corner that opens WhatsApp chat with pre-filled message. Uses green WhatsApp brand color.",
  "frontend/src/components/Footer.tsx": "Footer component with logo watermark, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), and copyright notice. Includes bilingual support and developer attribution.",
  "frontend/src/components/Gallery.tsx": "Photo gallery component displaying 4 images in a responsive grid with lightbox dialog for full-screen viewing. Includes previous/next navigation and hover effects.",
  "frontend/src/components/Hero.tsx": "Hero section with animated gradient background, centered logo, institute name, tagline (Education/Discipline/Success), and WhatsApp CTA button. Includes scroll indicator animation.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right language toggle button that switches between English and Bengali. Shows opposite language label as button text.",
  "frontend/src/components/SubmitReview.tsx": "React component for submitting student reviews with a form including name, class/year, subjects, review text, and star rating. Handles form validation, submission via mutation hook, and displays success/error toasts with bilingual support.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teachers (Sonali Ma'am, Abhijit Da, Santanu Sir) with their classes, subjects, experience, and teaching focus. Uses avatar components and hover effects with bilingual content.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed interface showing class notes organized by teacher and grade level (LKG-3, 4-10, 4-12). Displays teacher profiles with avatars and features downloadable PDFs and worksheets with bilingual support.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid layout with icons and bilingual descriptions.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for managing language state (English/Bengali) with sessionStorage persistence. Exports useLanguage hook and translation helper function for bilingual content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor with authentication support. Handles both authenticated and anonymous actors, invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration. Manages login status, identity state, and AuthClient creation with configurable options and delegation handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for review operations: useSubmitReview (mutation to submit reviews with cache invalidation), useGetAllReviews (fetches all reviews), and useGetApprovedReviews (fetches only approved reviews).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, defines CSS custom properties for colors, includes custom animations (fade-in, scroll, gradient), and sets up typography with Inter and Poppins fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom colors using oklch color space (gold, maroon, sidebar variants), custom border radius variables, font families (Inter, Poppins), and accordion animations.",
  "project_state.json": "Project metadata describing a bilingual coaching centre website with features including hero section, courses, teacher profiles, photo gallery, admission form with WhatsApp integration, and gold/maroon branding on dark background."
}