{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four completed features for replacing teacher profile placeholder images with actual uploaded photos and rendering them as static assets in the Teachers component.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing the structure and functionality of the Brilliant Coaching Centre website including Hero, About, Courses, Teachers, Gallery, Contact, and supporting components.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining the design system for the coaching centre website with gold, maroon, and neutral color schemes.",
  "frontend/index.html": "HTML entry point that loads the React application with UTF-8 charset, viewport meta tag, and title 'Brilliant Coaching Centre Website'.",
  "frontend/src/App.tsx": "Root React component that wraps the entire application in LanguageProvider and renders all page sections (Hero, About, Courses, WhyChooseUs, Teachers, Gallery, AdmissionForm, Contact, Footer) plus LanguageToggle and FloatingWhatsApp components.",
  "frontend/src/components/About.tsx": "About Us section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations in a responsive grid layout.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with fields for student name, class, subject, and mobile number that validates input and sends a formatted WhatsApp message to +91 98834 48350 with toast notifications for user feedback.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact methods (Address, Phone, WhatsApp) in card layout with clickable actions and a map placeholder, all with bilingual support and hover animations.",
  "frontend/src/components/Courses.tsx": "Displays three course offerings (LKG-IV, V-X, XI-XII) with bilingual support, showing class levels, subjects, and descriptions in a responsive card grid layout.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that opens a chat with a pre-filled message in the user's selected language.",
  "frontend/src/components/Footer.tsx": "Displays footer with logo watermark, contact information, copyright notice, and attribution link to caffeine.ai with bilingual text support.",
  "frontend/src/components/Gallery.tsx": "Shows a photo gallery grid with lightbox dialog for full-screen viewing, including navigation controls and bilingual captions for classroom and event images.",
  "frontend/src/components/Hero.tsx": "Hero section featuring the coaching center logo, bilingual name and tagline (Education, Discipline, Success), and a WhatsApp CTA button with animated background effects.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right button that toggles between English and Bengali languages, displaying the opposite language name as the button label.",
  "frontend/src/components/Teachers.tsx": "Displays three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with photos, classes taught, subjects, experience, and teaching focus in a responsive grid.",
  "frontend/src/components/WhyChooseUs.tsx": "Showcases five key benefits (experienced teachers, small batches, regular tests, friendly environment, affordable fees) with icons and bilingual descriptions in a card grid.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual language switching (English/Bengali) with session storage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages ICP backend actor instances, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, custom animations (fade-in, scroll, gradient), and OKLCH color space variables.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), typography, animations, and responsive container settings.",
  "project_state.json": "Project metadata describing a bilingual coaching centre website with WhatsApp integration, photo gallery, admission forms, and brand-specific styling (gold/maroon theme), including image processing requirements for teacher portraits."
}