{
  "backend/main.mo": "Main Motoko actor that manages galleries and images with CRUD operations, using blob storage mixin and Map data structures for persistence.",
  "feature_evidence.json": "Feature evidence report documenting the update of Footer component social media links to actual URLs for Facebook, YouTube, Instagram, and WhatsApp channel.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing their functionality, including Hero, About, Courses, Gallery, AdmissionForm, Contact, Footer, and supporting components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point that loads the React application with UTF-8 charset, viewport meta tag, and title \"Brilliant Coaching Centre Website\".",
  "frontend/src/App.tsx": "Root React component that wraps all sections in LanguageProvider and renders Hero, About, Courses, WhyChooseUs, Teachers, TeachersNotes, Gallery, AdmissionForm, Contact, Footer, LanguageToggle, FloatingWhatsApp, and Toaster components.",
  "frontend/src/components/About.tsx": "About Us section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component that collects student details (name, class, subject, mobile) and sends formatted WhatsApp message to +91 98834 48350 with validation and toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section displaying address, phone, and WhatsApp info in three cards with clickable actions, plus a map placeholder, all with bilingual support.",
  "frontend/src/components/Courses.tsx": "Displays a grid of three course offerings (LKG-Class IV, Class V-X, Class XI-XII) with icons, subjects, and descriptions in bilingual format. Uses Card components with hover effects and gradient styling.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that opens a chat with a pre-filled message for inquiries. Uses green WhatsApp branding colors.",
  "frontend/src/components/Footer.tsx": "Displays footer with logo watermark, contact information, social media links (Facebook, YouTube, Instagram, WhatsApp), and attribution to developer. Includes bilingual content and current year display.",
  "frontend/src/components/Gallery.tsx": "Shows a responsive photo gallery grid with lightbox dialog for full-size viewing. Includes navigation controls (previous/next) and displays classroom and event images with hover effects.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, centered logo, institute name, tagline (Education • Discipline • Success), and WhatsApp CTA button. Includes scroll indicator animation.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right button that toggles between English and Bengali languages using the LanguageContext. Displays opposite language name as button text.",
  "frontend/src/components/Teachers.tsx": "Displays three teacher profiles in a grid with avatar initials, classes taught, subjects, experience, and focus areas. Features hover effects and bilingual content for each teacher card.",
  "frontend/src/components/TeachersNotes.tsx": "React component displaying teacher profiles and downloadable class notes organized by grade levels (LKG-3, 4-10, 4-12) with tabbed navigation and bilingual support.",
  "frontend/src/components/WhyChooseUs.tsx": "React component showcasing five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a grid layout with icons.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual (English/Bengali) language switching with session storage persistence and translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook managing ICP backend actor creation with Internet Identity authentication, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/maroon color scheme, OKLCH color space, custom animations, and utility classes for brand colors.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH colors (gold/maroon), container settings, animations, and typography plugins.",
  "project_state.json": "Project state file tracking a bilingual coaching centre website with 25 versions, featuring hero section, courses, teacher profiles, photo gallery, WhatsApp integration, and downloadable class notes. Includes architectural notes for mobile-first design, brand colors (gold/yellow, dark background, maroon accents), and generated teacher portrait images."
}