{
  "backend/main.mo": "Main Motoko actor implementing blob storage mixin with data structures and CRUD operations for students, test results, attendance, galleries, images, and reviews (with approval workflow).",
  "feature_evidence.json": "Feature evidence report documenting the logo replacement task in Hero.tsx, referencing the Brilliant Coaching Centre logo asset with lightbulb design.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero with logo, About, Courses, Gallery, Contact with Google Maps, Teachers, StudentDashboard, and bilingual support throughout.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for the Brilliant Coaching Centre branding (gold, maroon, dark backgrounds).",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'Brilliant Coaching Centre Website', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping the app with QueryClient and LanguageProvider, rendering all sections (Hero through Footer) plus LanguageToggle, FloatingWhatsApp, and Toaster.",
  "frontend/src/components/About.tsx": "About section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form with fields for student name, class, subject, and mobile that validates input and opens WhatsApp with pre-filled message to +91 98834 48350.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying address, phone, and WhatsApp info with clickable actions, plus an embedded Google Maps iframe showing the coaching centre location.",
  "frontend/src/components/Courses.tsx": "Courses section component displaying three course offerings (LKG-IV all subjects, V-X English/Math, XI-XII English) in a responsive card grid with icons and descriptions.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right that opens a WhatsApp chat with a pre-filled message when clicked.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), and copyright notice with watermark background.",
  "frontend/src/components/Gallery.tsx": "Photo gallery section displaying a grid of images with hover effects and a lightbox dialog for full-screen viewing with previous/next navigation.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline (Education/Discipline/Success), WhatsApp admission enquiry button, and scroll indicator.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed language toggle button in top-right corner that switches between English and Bengali using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Displays a 'Coming Soon' section for the student dashboard feature, showcasing three planned features (login system, notes/test results, attendance) with icons and bilingual descriptions.",
  "frontend/src/components/SubmitReview.tsx": "Provides a form for students to submit reviews with fields for name, class/year, subjects, review text, and a 5-star rating; uses mutation hook to submit data and displays toast notifications.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and teaching focus areas in a bilingual card layout.",
  "frontend/src/components/TeachersNotes.tsx": "Shows a tabbed interface for class-wise teacher notes organized by grade ranges (LKG-3, 4-10, 4-12), displaying teacher profiles and downloadable note features for each category.",
  "frontend/src/components/Testimonials.tsx": "Renders a testimonials section with a blank state message encouraging students to be the first to share their experience, including decorative background elements.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in an animated grid layout with icons.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for bilingual support (English/Bengali) with language toggle functionality, translation helper function, and sessionStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP blockchain login/logout, managing identity state, authentication status, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for review operations including submitting reviews (mutation) and fetching all or approved reviews (queries) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography settings for the coaching centre brand.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), typography plugins, container queries, animations, and brand-specific design tokens.",
  "project_state.json": "Project metadata tracking the bilingual coaching centre website's features, architecture (mobile-first, WhatsApp integration, ICP backend), generated teacher images, and known requirements with version 37 state."
}