{
  "backend/main.mo": "Main Motoko actor implementing gallery and image management with CRUD operations for galleries and images, using blob storage mixin and Map data structures.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing a bilingual coaching centre website with hero, courses, gallery, admission form, and contact sections.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the Brilliant Coaching Centre website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping all sections (Hero, About, Courses, Teachers, Gallery, Contact, etc.) with LanguageProvider and rendering floating UI elements like WhatsApp button and language toggle.",
  "frontend/src/components/About.tsx": "About section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with validation that collects student details and sends formatted WhatsApp message to +91 98834 48350 with toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section displaying address, phone, and WhatsApp info in three cards with clickable actions and a map placeholder, all with bilingual support.",
  "frontend/src/components/Courses.tsx": "Displays a grid of three course offerings (LKG-IV, V-X, XI-XII) with icons, subjects, and descriptions, supporting bilingual content via LanguageContext.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button that opens a chat with a pre-filled message in the user's selected language.",
  "frontend/src/components/Footer.tsx": "Displays footer with logo watermark, contact info, copyright notice, and attribution link to caffeine.ai, supporting bilingual text.",
  "frontend/src/components/Gallery.tsx": "Shows a photo gallery grid with lightbox dialog for full-size viewing and navigation controls, supporting bilingual captions.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline, and WhatsApp CTA button for admission enquiries, supporting bilingual content.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed button in top-right corner that toggles between English and Bengali languages using LanguageContext.",
  "frontend/src/components/Teachers.tsx": "Displays three teacher profiles with avatars, classes taught, subjects, experience, and focus areas in a responsive grid layout.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed interface showing teacher profiles and downloadable class notes organized by grade ranges (LKG-3, 4-10, 4-12) with bilingual support.",
  "frontend/src/components/WhyChooseUs.tsx": "React component displaying five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid with icons, bilingual support, and hover animations.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual language switching (English/Bengali) with sessionStorage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages Internet Computer backend actor creation with authentication support, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable auth client options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon brand colors, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), container settings, custom animations, and typography plugins.",
  "project_state.json": "Project metadata describing a bilingual coaching center website with features including hero section, courses, teacher profiles, photo gallery, WhatsApp integration, and downloadable class notes with gold/maroon branding."
}