{
  "backend/main.mo": "Main Motoko actor implementing gallery management (create, get, delete), image management with blob storage, and review management with moderation (submit, approve, fetch) using Map data structures.",
  "feature_evidence.json": "Feature evidence report documenting implemented testimonials component features including page titles, introduction sections, student reviews, and styling with high confidence test coverage.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero, About, Courses, Teachers, Testimonials, Gallery, forms, and utility components with bilingual support and responsive design details.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, primary, secondary, accent, and sidebar colors with custom radius.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'Brilliant Coaching Centre Website', and root div mounting the React application.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and LanguageProvider, rendering all page sections in order from Hero to Footer with floating UI elements and toast notifications.",
  "frontend/src/components/About.tsx": "About Us section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, gradient background, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with fields for student name, class, subject, and mobile that validates input and sends formatted WhatsApp message to the coaching centre with toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying address, phone, and WhatsApp contact info with interactive cards and a map placeholder. Includes bilingual support and click-to-call/WhatsApp functionality.",
  "frontend/src/components/Courses.tsx": "Courses section component showcasing three course levels (LKG-IV, V-X, XI-XII) with subjects, descriptions, and icons. Uses card layout with hover effects and bilingual content.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right that opens WhatsApp chat with pre-filled message. Includes bilingual aria-label and hover animations.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), copyright notice, and watermark background. Fully bilingual with external link handling.",
  "frontend/src/components/Gallery.tsx": "Photo gallery section with grid layout and lightbox dialog for viewing images. Includes navigation controls (prev/next) and keyboard support for image browsing.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline, and WhatsApp CTA button. Features decorative elements, scroll indicator, and bilingual content.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed language toggle button (top-right) that switches between English and Bengali using the LanguageContext. Displays opposite language label for clarity.",
  "frontend/src/components/SubmitReview.tsx": "A form component for submitting student reviews with fields for name, class/year, subjects, review text, and a 5-star rating system. Handles form validation, submission via mutation hook, and displays success/error toasts with bilingual support.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with their classes, subjects, experience, and teaching focus areas. Uses avatar components and hover effects with bilingual content.",
  "frontend/src/components/TeachersNotes.tsx": "A tabbed interface showing downloadable class notes organized by teacher and grade level (LKG-3, 4-10, 4-12). Each tab displays teacher info with avatar, experience, and note features with download functionality.",
  "frontend/src/components/Testimonials.tsx": "Renders testimonial cards from current students and alumni with avatars, names, classes, and reviews. Supports bilingual content and includes visual differentiation between current students and alumni testimonials.",
  "frontend/src/components/WhyChooseUs.tsx": "Displays five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid with icons and hover animations.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing language state (English/Bengali) with session storage persistence. Exports useLanguage hook and translation helper function for bilingual content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an actor instance for backend communication, handling both authenticated (with Internet Identity) and anonymous actors. Automatically invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for review operations including submitting reviews, fetching all reviews, and fetching approved reviews with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, custom animations (fade-in, scroll, gradient), and typography utilities for the coaching centre branding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system for gold/maroon branding, custom animations, container settings, and typography/container-queries plugins.",
  "project_state.json": "Project metadata describing a bilingual coaching centre website with features including hero section, courses, teacher profiles, photo gallery, testimonials with review submission, WhatsApp integration, and gold/maroon branding."
}