{
  "backend/main.mo": "Main Motoko actor implementing gallery management (create/get/delete galleries and images with blob storage), review management (submit/approve/get reviews), and placeholder CRUD functions for future student dashboard functionality (students, test results, attendance records).",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for replacing Santanu Sir's profile image with 'image (2)-5.jpg' in Teachers.tsx and TeachersNotes.tsx components, and storing it as a static asset in frontend/public/assets/generated.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the bilingual React application for Brilliant Coaching Centre, including Hero, About, Courses, Teachers (with Santanu Sir's new photo), Gallery, Contact with Google Maps, StudentDashboard, and various UI components with WhatsApp integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for Brilliant Coaching Centre branding (gold, maroon, background, foreground, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'Brilliant Coaching Centre Website', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and LanguageProvider, rendering all page sections (Hero, About, Courses, Teachers, Gallery, Contact, StudentDashboard, Footer) plus LanguageToggle, FloatingWhatsApp, and Toaster components.",
  "frontend/src/components/About.tsx": "About Us section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual titles/descriptions, hover effects, and gradient background.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with fields for student name, class, subject, and mobile number that validates input, generates formatted WhatsApp message to +919883448350, and displays toast notifications with bilingual support.",
  "frontend/src/components/Contact.tsx": "Contact section component displaying address, phone, and WhatsApp info with clickable actions, plus an embedded Google Maps iframe showing the coaching centre location.",
  "frontend/src/components/Courses.tsx": "Courses section component displaying three course offerings (LKG-IV all subjects, V-X English/Math, XI-XII English) in a responsive card grid with icons and descriptions.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating WhatsApp button positioned at bottom-right that opens a WhatsApp chat with a pre-filled message when clicked.",
  "frontend/src/components/Footer.tsx": "Footer component with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), and copyright notice with watermark background.",
  "frontend/src/components/Gallery.tsx": "Photo gallery section displaying images in a responsive grid with lightbox dialog for full-size viewing and navigation controls (previous/next).",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline (Education/Discipline/Success), and WhatsApp admission enquiry CTA button.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed language toggle button (top-right) that switches between English and Bengali using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Displays a 'Coming Soon' section for the student dashboard feature, showcasing three planned features (login system, notes/test results, attendance) with icons and bilingual descriptions.",
  "frontend/src/components/SubmitReview.tsx": "Provides a form for students to submit reviews with fields for name, class/year, subjects, review text, and a 5-star rating; uses mutation hook to submit data and displays toast notifications.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and focus areas in a bilingual card layout.",
  "frontend/src/components/TeachersNotes.tsx": "Shows a tabbed interface for class-wise teacher notes organized by grade ranges (LKG-3, 4-10, 4-12), displaying teacher info and note features with download placeholders.",
  "frontend/src/components/Testimonials.tsx": "Renders a testimonials section with a blank state message encouraging students to be the first to share their experience, includes decorative background elements.",
  "frontend/src/components/WhyChooseUs.tsx": "Presents five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in an animated card grid with icons.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for bilingual support (English/Bengali) with language toggle functionality, translation helper function, and sessionStorage persistence.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for review operations including submitting reviews (mutation) and fetching all/approved reviews (queries) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, defining CSS variables for UI components and custom animations (fade-in, scroll, gradient).",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (gold, maroon, oklch-based design tokens), typography, animations, and responsive container settings for the coaching centre website.",
  "project_state.json": "Project metadata describing a bilingual coaching centre website with features including hero section, course listings, teacher profiles, photo gallery, testimonials, review submission, and WhatsApp integration using gold/maroon branding."
}