{
  "backend/main.mo": "Main Motoko actor implementing gallery and image management with CRUD operations for galleries and images, using blob storage mixin and Map data structures.",
  "feature_evidence.json": "Feature evidence report documenting the removal of Abhijit Da's teacher profile image from TeachersNotes component, replacing it with an initials-based fallback avatar.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero, About, Courses, Teachers, TeachersNotes, Gallery, Contact sections with bilingual support and WhatsApp integration.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for Brilliant Coaching Centre branding (gold, maroon, dark backgrounds).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Brilliant Coaching Centre website.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClient and LanguageProvider, rendering all main sections (Hero, About, Courses, Teachers, Gallery, Contact, etc.) plus floating utilities.",
  "frontend/src/components/About.tsx": "About Us section displaying four key features (Concept Clarity, Personal Care, Discipline, Exam Preparation) in an animated grid with bilingual content support.",
  "frontend/src/components/AdmissionForm.tsx": "Empty file placeholder for admission form component.",
  "frontend/src/components/Contact.tsx": "Contact section with address, phone, WhatsApp info and embedded Google Maps iframe showing Brilliant Coaching Centre location in Puabagan, Bankura with bilingual support.",
  "frontend/src/components/Courses.tsx": "Courses section displaying three tier cards (LKG-IV All Subjects, V-X English & Math, XI-XII English) with icons, badges, and bilingual descriptions.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed bottom-right floating WhatsApp button that opens chat with pre-filled enquiry message to +91 98834 48350 with green branding.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), and a copyright notice with a watermark background logo.",
  "frontend/src/components/Gallery.tsx": "Displays a photo gallery grid with classroom and event images; clicking an image opens a lightbox dialog with previous/next navigation controls.",
  "frontend/src/components/Hero.tsx": "Hero section featuring the coaching centre logo, name, tagline (Education, Discipline, Success), and a WhatsApp CTA button for admission enquiries with animated background elements.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed-position button in the top-right corner that toggles between English and Bengali languages using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/SubmitReview.tsx": "Empty file with no content.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and teaching focus areas.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed interface showing teacher profiles and their class notes organized by grade ranges (LKG-3, 4-10, 4-12) with download functionality placeholders.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section with a blank state message encouraging students to be the first to share their experience; no reviews are currently displayed.",
  "frontend/src/components/WhyChooseUs.tsx": "React component displaying five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid layout with icons, bilingual support, and hover animations.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual language switching (English/Bengali) with session storage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages ICP backend actor creation with authentication support, using React Query for caching and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and auth client lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty file placeholder for future query hooks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system (gold, maroon, dark backgrounds), container settings, custom animations, and typography plugins.",
  "project_state.json": "Project metadata tracking features, architecture notes, and generated images for a bilingual coaching center website with WhatsApp integration, photo gallery, testimonials, and downloadable class notes."
}