{
  "backend/main.mo": "Main Motoko actor implementing gallery and image management with blob storage, providing CRUD operations for galleries and images with gallery association validation.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend components, contexts, and configuration files for the Brilliant Coaching Centre website.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for the coaching centre's gold and maroon branding.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Brilliant Coaching Centre website.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClient and LanguageProvider, rendering all page sections (Hero, About, Courses, Teachers, Gallery, Contact, Footer) plus floating utilities and toast notifications.",
  "frontend/src/components/About.tsx": "About section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Empty file placeholder for admission form component.",
  "frontend/src/components/Contact.tsx": "Contact section showing address, phone, and WhatsApp info with clickable actions, plus embedded Google Maps iframe for the Puabagan, Bankura location with bilingual support.",
  "frontend/src/components/Courses.tsx": "Courses section displaying three tier cards (LKG-IV All Subjects, V-X English & Math, XI-XII English) with icons, badges, and bilingual descriptions in a responsive grid.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed bottom-right floating WhatsApp button that opens chat with pre-filled enquiry message to +91 98834 48350 with green branding and hover effects.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with logo, tagline, contact info, social media links (Facebook, YouTube, Instagram, WhatsApp), copyright notice, and a watermark background image. Supports bilingual content via LanguageContext.",
  "frontend/src/components/Gallery.tsx": "Displays a photo gallery grid with four images of classroom and event scenes. Clicking an image opens a lightbox dialog with previous/next navigation controls.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline (Education • Discipline • Success), and a WhatsApp CTA button for admission enquiries. Includes scroll indicator animation.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed-position button in the top-right corner that toggles between English and Bengali languages using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Empty file with no content.",
  "frontend/src/components/SubmitReview.tsx": "Empty file with no content.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and teaching focus areas.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed interface showing teacher profiles and class notes for three class ranges (LKG-3, 4-10, 4-12). Each tab displays teacher info, features, and a placeholder download button.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section with a blank state message indicating no reviews yet, encouraging users to be the first to share their experience.",
  "frontend/src/components/WhyChooseUs.tsx": "React component displaying five benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) with bilingual support and animated cards using Lucide icons.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual (English/Bengali) language switching with sessionStorage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor with authentication support, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with dark theme color scheme using gold and maroon accents, custom utility classes, and keyframe animations for fade-in, scroll, and gradient effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system (gold/maroon palette), container settings, custom animations, and typography plugins.",
  "project_state.json": "Project metadata tracking a tutoring platform with an active fix request to increase stable memory allocation from 0 to 512 MB for handling image uploads, student data, reviews, and file storage."
}