{
  "backend/main.mo": "Main Motoko actor implementing gallery and image management with CRUD operations for galleries and images, using blob storage mixin for handling image data.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of adding Santanu Sir's profile photo (image (2)-6.jpg) to the Teachers section, referencing Teachers.tsx and multiple components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including Hero, About, Courses, Gallery, Teachers sections with bilingual support and WhatsApp integration details.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining light/dark theme variables for Brilliant Coaching Centre branding (gold, maroon, dark backgrounds).",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Brilliant Coaching Centre website.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClient and LanguageProvider, rendering all main sections (Hero, About, Courses, Teachers, Gallery, Contact, etc.) with toast notifications.",
  "frontend/src/components/About.tsx": "About Us section displaying four key features (Concept Clarity, Personal Care, Discipline, Exam Preparation) in a responsive grid with icons and bilingual content support.",
  "frontend/src/components/AdmissionForm.tsx": "Empty file placeholder for admission form component.",
  "frontend/src/components/Contact.tsx": "Contact section with address, phone, WhatsApp info and embedded Google Maps iframe showing Brilliant Coaching Centre location in Puabagan, Bankura with bilingual support.",
  "frontend/src/components/Courses.tsx": "Courses section displaying three tier cards (LKG-IV All Subjects, V-X English & Math, XI-XII English) with icons, badges, and bilingual descriptions in a responsive grid.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed bottom-right floating WhatsApp button that opens chat with pre-filled enquiry message to +91 98834 48350 with green WhatsApp branding.",
  "frontend/src/components/Footer.tsx": "Footer component displaying the coaching center's logo, tagline, contact information, social media links (Facebook, YouTube, Instagram, WhatsApp), and a copyright notice with a watermark background logo.",
  "frontend/src/components/Gallery.tsx": "Gallery component showing a grid of images with hover effects and a lightbox dialog for viewing full-size images with navigation controls (previous/next).",
  "frontend/src/components/Hero.tsx": "Hero section component featuring the coaching center's logo, name, tagline (Education, Discipline, Success), a WhatsApp admission enquiry button, and animated background elements.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed-position button component that toggles between English and Bengali languages using the LanguageContext.",
  "frontend/src/components/StudentDashboard.tsx": "Empty component file with no content.",
  "frontend/src/components/SubmitReview.tsx": "Empty component file with no content.",
  "frontend/src/components/Teachers.tsx": "Teachers section displaying cards for three teachers (Sonali Ma'am, Abhijit Da, Santanu Sir) with their avatars, classes taught, subjects, experience, and teaching focus areas.",
  "frontend/src/components/TeachersNotes.tsx": "Tabbed component showing teacher profiles and their class notes organized by grade ranges (LKG-3, 4-10, 4-12) with download functionality placeholders and feature descriptions.",
  "frontend/src/components/Testimonials.tsx": "Testimonials section with a blank state message encouraging users to be the first to share their experience, including decorative background elements.",
  "frontend/src/components/WhyChooseUs.tsx": "React component displaying five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid with icons and bilingual support.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual (English/Bengali) language switching with sessionStorage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an ICP backend actor with authentication support, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Empty file, likely a placeholder for future query hooks.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold and maroon colors, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom colors (gold, maroon), OKLCH color system, custom animations (accordion), and typography/container query plugins.",
  "project_state.json": "Project metadata tracking feature requests for storage expansion (512 MB stable memory) and teacher profile image uploads for Brilliant Coaching Centre tutoring platform."
}