{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting two completed features for replacing and storing the Brilliant Coaching Centre logo in the Hero component with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing a bilingual (English/Bengali) coaching centre website with hero, about, courses, teachers, gallery, admission form, contact sections, and floating WhatsApp integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining the design system for the coaching centre branding.",
  "frontend/index.html": "HTML entry point that loads the React application with title 'Brilliant Coaching Centre Website' and mounts to root div.",
  "frontend/src/App.tsx": "Main React component wrapping all sections (Hero, About, Courses, WhyChooseUs, Teachers, Gallery, AdmissionForm, Contact, Footer) with LanguageProvider and floating UI elements (LanguageToggle, FloatingWhatsApp).",
  "frontend/src/components/About.tsx": "About Us section displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons in a responsive grid with bilingual support and hover animations.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form with validation that collects student details (name, class, subject, mobile) and sends a formatted WhatsApp message to +91 98834 48350 with toast notifications.",
  "frontend/src/components/Contact.tsx": "Contact section displaying three contact methods (Address, Phone, WhatsApp) in cards with clickable actions and a map placeholder, all with bilingual content support.",
  "frontend/src/components/Courses.tsx": "Displays three course offerings (LKG-IV, V-X, XI-XII) with bilingual content, icons, and hover effects using Card components and language context.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Renders a fixed floating WhatsApp button in the bottom-right corner that opens a chat with a pre-filled bilingual message.",
  "frontend/src/components/Footer.tsx": "Displays footer with watermark logo, contact info, copyright notice, and attribution link to caffeine.ai with bilingual support.",
  "frontend/src/components/Gallery.tsx": "Shows a photo gallery grid with lightbox dialog for full-size viewing and navigation controls, supporting bilingual captions.",
  "frontend/src/components/Hero.tsx": "Hero section with animated background, logo, institute name, tagline, WhatsApp CTA button, and scroll indicator with bilingual text.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right button that toggles between English and Bengali languages using the language context.",
  "frontend/src/components/Teachers.tsx": "Displays three teacher profiles with photos, classes taught, subjects, experience, and focus areas in a responsive grid with hover effects.",
  "frontend/src/components/WhyChooseUs.tsx": "Showcases five key benefits (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a grid with icons and bilingual descriptions.",
  "frontend/src/contexts/LanguageContext.tsx": "React context provider for bilingual language switching (English/Bengali) with session storage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous backend actor using Internet Identity, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, including CSS custom properties, animations, and utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrapper around the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system (gold/maroon), typography, animations, and container settings for the coaching centre brand.",
  "project_state.json": "Project metadata defining a bilingual coaching centre website with WhatsApp integration, photo gallery, admission forms, and brand-specific design (gold/maroon theme) for Brilliant Coaching Centre."
}