{
  "backend/main.mo": "Main Motoko actor implementing blob storage mixin with data structures and CRUD operations for students, test results, attendance, galleries, images, and reviews (with approval workflow).",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features for replacing Santanu Sir's profile image with 'image (2)-4.jpg' in Teachers.tsx and TeachersNotes.tsx components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components describing the bilingual coaching centre website with hero, courses, gallery, admission form, contact map, student dashboard, and teacher profiles including Santanu Sir's uploaded photo.",
  "frontend/index.css": "Global CSS with Tailwind layers defining OKLCH color system variables for light and dark themes, including custom coaching centre branding colors (gold, maroon) and design tokens.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title 'Brilliant Coaching Centre Website', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the application with QueryClientProvider and LanguageProvider, rendering all page sections (Hero through Footer) plus LanguageToggle, FloatingWhatsApp, and Toaster components.",
  "frontend/src/components/About.tsx": "About Us section component displaying four feature cards (Concept Clarity, Personal Care, Discipline, Exam Preparation) with icons, bilingual content, and hover animations in a responsive grid.",
  "frontend/src/components/AdmissionForm.tsx": "Admission enquiry form component with fields for student name, class, subject, and mobile that validates input and opens WhatsApp with pre-filled message to +91 98834 48350, showing toast notifications.",
  "frontend/src/components/Contact.tsx": "Displays contact information (address, phone, WhatsApp) with interactive cards and an embedded Google Maps iframe. Includes click-to-call and WhatsApp messaging actions with bilingual support.",
  "frontend/src/components/Courses.tsx": "Renders three course cards (LKG-IV all subjects, V-X English/Math, XI-XII English) with icons, descriptions, and hover animations. Uses shadcn Card and Badge components with bilingual content.",
  "frontend/src/components/FloatingWhatsApp.tsx": "Fixed floating button in bottom-right corner that opens WhatsApp with a pre-filled message for inquiries. Uses green WhatsApp brand color with hover effects.",
  "frontend/src/components/Footer.tsx": "Footer with watermark logo, contact details, social media links (Facebook, YouTube, Instagram, WhatsApp), and copyright notice with bilingual support. Includes attribution to developer.",
  "frontend/src/components/Gallery.tsx": "Photo gallery grid with lightbox dialog for full-screen image viewing. Includes navigation arrows, keyboard controls, and hover effects on thumbnails with bilingual captions.",
  "frontend/src/components/Hero.tsx": "Hero section with animated gradient background, center-aligned logo, institute name, tagline (Education/Discipline/Success), and WhatsApp CTA button. Includes scroll indicator animation.",
  "frontend/src/components/LanguageToggle.tsx": "Fixed top-right button that toggles between English and Bengali languages. Displays opposite language label and uses Languages icon from lucide-react.",
  "frontend/src/components/StudentDashboard.tsx": "Displays a 'Coming Soon' section for the student dashboard feature, showcasing three planned features (login system, notes/test results, attendance tracking) with icons and bilingual descriptions.",
  "frontend/src/components/SubmitReview.tsx": "Provides a form for students to submit reviews with fields for name, class/year, subjects, review text, and a 5-star rating system; uses mutation hook to submit data and displays toast notifications.",
  "frontend/src/components/Teachers.tsx": "Displays a grid of three teacher profiles (Sonali Ma'am, Abhijit Da, Santanu Sir) with avatars, classes taught, subjects, experience, and focus areas in a card layout.",
  "frontend/src/components/TeachersNotes.tsx": "Shows a tabbed interface for accessing class notes organized by teacher and grade level (LKG-3, 4-10, 4-12), with teacher profiles and downloadable note features.",
  "frontend/src/components/Testimonials.tsx": "Renders a testimonials section with a blank state message indicating no reviews yet, encouraging users to be the first to share their experience.",
  "frontend/src/components/WhyChooseUs.tsx": "Displays five key benefits of the coaching center (experienced teachers, small batches, regular tests, friendly environment, affordable fees) in a responsive grid with icons and descriptions.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for bilingual language switching (English/Bengali) with session storage persistence and a translation helper function.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for review operations including submitting reviews (mutation) and fetching all/approved reviews (queries) using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom dark theme using gold/yellow and maroon color scheme, OKLCH color space, custom animations (fade-in, scroll, gradient), and typography settings for the coaching centre branding.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH-based color system (gold, maroon, dark backgrounds), container settings, custom animations, and typography plugins for the coaching centre design system.",
  "project_state.json": "Project metadata tracking the bilingual coaching centre website's features, architecture (mobile-first, WhatsApp integration, ICP backend), generated teacher images, and brand guidelines (gold/yellow text, dark background, maroon accents)."
}