{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Create testimonials page with current students, alumni reviews, and review submission form",
  "requirements": [
    {
      "id": "REQ-55",
      "summary": "Create Testimonials component with bilingual page title and subtitle",
      "acceptanceCriteria": [
        "Page title 'What Our Students Say' is prominently displayed at the top of the section",
        "Subtitle 'Read real experiences from our students and alumni, and share your own journey' appears below the title",
        "Both title and subtitle support bilingual switching between English and Bengali using LanguageContext",
        "Typography and spacing match existing section headers in the application"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "create",
          "description": "Create new Testimonials component with section wrapper, page title 'What Our Students Say', and subtitle 'Read real experiences from our students and alumni, and share your own journey'. Use the t() translation helper from LanguageContext for bilingual support. Apply consistent styling with existing section components (dark background, gold/maroon theme)."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Add page introduction section to Testimonials component with bilingual support",
      "acceptanceCriteria": [
        "Introduction text is displayed in a prominent, readable format below the page title",
        "Text supports bilingual switching between English and Bengali",
        "Styling is consistent with other descriptive text sections in the application"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Add introduction paragraph displaying 'At Brilliant Coaching Centre, we focus on building confidence, clarity, and academic excellence. Don't just take our word for it—hear from current and past students about how our teachers, notes, and guidance have helped them succeed.' Use t() translation helper for bilingual content. Style with appropriate text size and spacing below the subtitle."
        }
      ]
    },
    {
      "id": "REQ-57",
      "summary": "Create Current Students Reviews section with three testimonials and bilingual support",
      "acceptanceCriteria": [
        "Section header 'Current Students' is clearly displayed",
        "All three student testimonials (Riya Sen, Anirban Das, Priya Roy) are rendered with student name, class, and review text",
        "Each testimonial card includes student photo placeholder or avatar",
        "All text content supports bilingual switching between English and Bengali",
        "Cards are displayed in a responsive grid layout or carousel slider"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Add Current Students section with header 'Current Students'. Create three testimonial cards for Riya Sen (Class 10), Anirban Das (Class 12), and Priya Roy (Class 3) with their review text. Use generated avatar images at frontend/public/assets/generated/riya-sen-avatar.dim_200x200.png, frontend/public/assets/generated/anirban-das-avatar.dim_200x200.png, and frontend/public/assets/generated/priya-roy-avatar.dim_200x200.png. Apply t() translation helper for all text content. Display in responsive grid layout."
        }
      ]
    },
    {
      "id": "REQ-58",
      "summary": "Style Current Students Reviews section with grid layout, hover effects, and mobile responsiveness",
      "acceptanceCriteria": [
        "Cards display in grid layout (2-3 columns on desktop) or carousel slider",
        "Each card includes student photo placeholder or avatar, name, and class information",
        "Hover effects are applied to cards (e.g., lift, shadow, scale)",
        "On mobile devices, cards stack vertically or become swipeable carousel",
        "Design matches existing component styling with gold/yellow text, dark background, and maroon accents"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Apply grid layout (grid-cols-1 md:grid-cols-2 lg:grid-cols-3) to Current Students testimonial cards. Add hover effects using transform, shadow, and scale transitions. Include circular avatar images with appropriate sizing. Ensure mobile-responsive design with vertical stacking on small screens. Use consistent dark background with gold/maroon theme matching existing components."
        }
      ]
    },
    {
      "id": "REQ-59",
      "summary": "Create Alumni Feedback section with three testimonials and bilingual support",
      "acceptanceCriteria": [
        "Section header 'Alumni Feedback' is clearly displayed",
        "All three alumni testimonials (Arjun Mukherjee, Sneha Chakraborty, Rohan Ghosh) are rendered with name and review text",
        "Each testimonial card includes photo placeholder or avatar",
        "All text content supports bilingual switching between English and Bengali",
        "Cards are displayed in carousel or grid layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Add Alumni Feedback section with header 'Alumni Feedback'. Create three testimonial cards for Arjun Mukherjee, Sneha Chakraborty, and Rohan Ghosh with their review text. Use generated avatar images at frontend/public/assets/generated/arjun-mukherjee-avatar.dim_200x200.png, frontend/public/assets/generated/sneha-chakraborty-avatar.dim_200x200.png, and frontend/public/assets/generated/rohan-ghosh-avatar.dim_200x200.png. Apply t() translation helper for all text content. Display in responsive grid or carousel layout."
        }
      ]
    },
    {
      "id": "REQ-60",
      "summary": "Style Alumni Feedback section with visual differentiation from Current Students section",
      "acceptanceCriteria": [
        "Alumni cards display in carousel or grid layout",
        "Section uses optional light background color or subtle styling variation to differentiate from Current Students section",
        "Hover effects and responsive behavior match Current Students section",
        "Overall design maintains consistency with application theme"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Apply grid or carousel layout to Alumni Feedback cards matching Current Students layout. Add optional light background color or subtle background variation (e.g., slightly lighter dark tone or maroon tint) to differentiate Alumni section from Current Students. Maintain consistent hover effects, responsive design, and theme alignment with gold/maroon color scheme."
        }
      ]
    },
    {
      "id": "REQ-61",
      "summary": "Update SubmitReview component to match testimonials page specification with bilingual support",
      "acceptanceCriteria": [
        "Component header displays 'Share Your Experience!' with bilingual support",
        "Subtitle 'We love hearing from our students. Tell us how Brilliant Coaching Centre has helped you grow and learn.' is shown below header",
        "Form includes all required fields: Full Name (required), Class/Year (required), Subject(s) Studied (optional), Review (textarea, required), Rating (1-5 stars, optional)",
        "Submit Review button validates required fields before submission",
        "Success message 'Thank you for your review! Your feedback helps us improve and inspire other students.' displays as toast notification on successful submission",
        "All text content supports bilingual switching between English and Bengali"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SubmitReview.tsx",
          "operation": "modify",
          "description": "Update SubmitReview component header to 'Share Your Experience!' and add subtitle 'We love hearing from our students. Tell us how Brilliant Coaching Centre has helped you grow and learn.' Update form field labels to match specification (Full Name, Class/Year, Subject(s) Studied, Review textarea, Rating 1-5 stars). Update success toast message to 'Thank you for your review! Your feedback helps us improve and inspire other students.' Ensure all text uses t() translation helper for bilingual support. Maintain existing form validation and submission logic."
        }
      ]
    },
    {
      "id": "REQ-62",
      "summary": "Integrate Testimonials component into App.tsx after TeachersNotes and before SubmitReview",
      "acceptanceCriteria": [
        "Testimonials component is imported and rendered in App.tsx",
        "Component is positioned after TeachersNotes section and before SubmitReview component",
        "Component flow and spacing maintain consistency with existing sections",
        "No layout breaks or styling conflicts are introduced"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import the new Testimonials component and render it in the main component tree after the TeachersNotes component and before the SubmitReview component. Ensure proper spacing and layout flow matching existing section arrangements. Verify no styling conflicts are introduced."
        }
      ]
    },
    {
      "id": "REQ-63",
      "summary": "Ensure all Testimonials component text supports bilingual switching using LanguageContext",
      "acceptanceCriteria": [
        "All static text in Testimonials component uses the t() translation helper function",
        "Bengali translations are provided for all English text content",
        "Language toggle instantly switches all testimonials section text between English and Bengali",
        "No hardcoded English-only text remains in the component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/contexts/LanguageContext.tsx",
          "operation": "modify",
          "description": "Add Bengali translations for all Testimonials component text including page title, subtitle, introduction paragraph, section headers ('Current Students', 'Alumni Feedback'), and all six testimonials (Riya Sen, Anirban Das, Priya Roy, Arjun Mukherjee, Sneha Chakraborty, Rohan Ghosh) with their names, classes, and review text. Ensure translation keys are accessible via t() helper function."
        },
        {
          "path": "frontend/src/components/Testimonials.tsx",
          "operation": "modify",
          "description": "Review all text content in Testimonials component and ensure every string uses the t() translation helper function with appropriate translation keys. Verify no hardcoded English text remains and that all content switches correctly when language toggle is activated."
        }
      ]
    }
  ]
}